* welcome to org.mode
try to add some text
second line
third line
* this is headline, it starts from one or more starts
if you want to fold(unfold) use `TAB` on heading line
** this is sub-heading (** in beginning prints as one *)
if you want to move-up(down) `ALT+k` or `ALT+j`
** moving around headings
ALT key in Emacs docs named as Meta `M`
promote heading up or down with `M+h` or `M+l`
1. To start numbered list just type `1` and `.`
   next line
   then `M+Enter`
2. and second numbered item in list
* how to use bold italic underlined code verbatim
1. to use bold just add *bold* nice
2. to use italic add /italic/ nice
3. to use underline add _underline_ nice
4. to use code add =int main(int argc, char** argv);= nice
5. to use verbatim add ~verbatim~ (означает дословный)
6. to use strike-throw +some text with strike throw+ nice
** TODO buy airplane
* How to integrate code samples in org
+ define block of code and point in it cursor
+ after it your should call
+ : org-babel-execute-maybe or (C-c C-v C-e)

#+begin_src python
return 'hello from python code! on Windows'
#+end_src

#+RESULTS:
: hello from python code! on Windows

#+begin_src bash
echo "hello world (on Windows too)"
#+end_src

#+RESULTS:
: hello world (on Windows too)

#+begin_src C
#include <stdio.h>
int main()
{
    printf("%s", "hello form C lang even on Windows!\n");
    return 0;
}
#+end_src

#+RESULTS:
: hello form C lang even on Windows!

#+begin_src C++
#include <iostream>
int main()
{
    std::cout << "hello world from C++!" << std::endl;
    return 0;
}
#+end_src

#+RESULTS:
: hello world from C++!

#+begin_src elisp
(+ 1 2 3 4 5)
#+end_src

#+RESULTS:
: 15

* Tables and Spreadsheets
** write table header TAB move to next cell, ENTER move to next row
** after header add |- and press ENTER and -+---+----+--- apeared
** or just read: https://orgmode.org/worg/org-tutorials/tables.html
** to recalculate all fields in table SPC+: org-table-iterate to update all cells
** also good tutorial for spreadsheet https://orgmode.org/worg/org-tutorials/org-spreadsheet-intro.html


| n | n^2 | n^3 | n^4 |   sqrt(n) |  sum(row) |
|---+-----+-----+-----+-----------+-----------|
| 1 |   1 |   1 |   1 |         1 |         5 |
| 2 |   4 |   8 |  16 | 1.4142136 | 31.414214 |
| 3 |   9 |  27 |  81 | 1.7320508 | 121.73205 |
| 4 |  16 |  64 | 256 |         2 |       342 |
#+TBLFM: $2=$1*$1::$3=$1*$1*$1::$4=$1*$1*$1*$1::$5=sqrt($1)::$6=vsum($1..$5)
